Tekla.Structures.Model.BoltCircle
The BoltCircle class defines a bolt group with a circle shape.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
ContourPlate cp = new ContourPlate();
cp.Profile.ProfileString = "PL20";
cp.AddContourPoint(new ContourPoint(new Point( 9000,  6000, 0),null));
cp.AddContourPoint(new ContourPoint(new Point(12000,  6000, 0),null));
cp.AddContourPoint(new ContourPoint(new Point(12000, 12000, 0),null));
cp.AddContourPoint(new ContourPoint(new Point( 9000, 12000, 0),null));
if (!cp.Insert())
Console.WriteLine("ContourPlate Insert failed!");
BoltCircle B = new BoltCircle();
B.PartToBeBolted = cp;
B.PartToBoltTo   = cp;
B.FirstPosition  = new Point( 9200,  6200, 0);
B.SecondPosition = new Point(12000, 12000, 0);
B.BoltSize     = 16;
B.Tolerance    = 3.00;
B.BoltStandard = "7968";
B.BoltType     = BoltGroup.BoltTypeEnum.BOLT_TYPE_WORKSHOP;
B.CutLength    = 105;
B.Length       = 100;
B.ExtraLength  = 15;
B.ThreadInMaterial = BoltGroup.BoltThreadInMaterialEnum.THREAD_IN_MATERIAL_NO;
B.Position.Depth          = Position.DepthEnum.MIDDLE;
B.Position.Plane          = Position.PlaneEnum.MIDDLE;
B.Position.Rotation       = Position.RotationEnum.FRONT;
B.Bolt    = true;
B.Washer1 = true;
B.Washer2 = true;
B.Washer3 = true;
B.Nut1    = true;
B.Nut2    = true;
B.Hole1   = true;
B.Hole2   = true;
B.Hole3   = true;
B.Hole4   = true;
B.Hole5   = true;
B.NumberOfBolts = 7;
B.Diameter      = 160;
if (!B.Insert())
Console.WriteLine("BoltCircle Insert failed!");
}
}

Tekla.Structures.Model.BoltCircle.NumberOfBolts
The number of bolts in the circle.

Tekla.Structures.Model.BoltCircle.Diameter
The diameter of the circle.

Tekla.Structures.Model.BoltCircle.#ctor
Creates a new bolt circle instance.

Tekla.Structures.Model.BoltCircle.Insert
Inserts the bolt circle into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.BoltCircle.Select
Selects a bolt circle from the model database. The ID must be set.
Returns: True on success.

Tekla.Structures.Model.BoltCircle.Modify
Modifies the existing bolt circle in the model database to match the current one.
Note, the IDs of Part To Bolt To, Part To Be Bolted and OtherParts cannot be modified.
Returns: True on success.

Tekla.Structures.Model.BoltCircle.Delete
Deletes the bolt circle instance with the given ID from the model database.
Returns: True on success.

Tekla.Structures.Model.BoltCircle.InsertSplitBolt
Inserts the bolt circle into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.BoltCircle.CreateSplitBoltInstance
Creates the split bolt instance.
Returns: True on succes, false otherwise.